#!/bin/bash

# Перевірка, що передано рівно два параметри
if [ "$#" -ne 2 ]; then
  echo "Будь ласка, введіть рівно два числові параметри."
  exit 1
fi

# Присвоєння параметрів змінним для зручності
param1=$1
param2=$2
script_name=$(basename "$0")

# Перевірка, чи є параметри числами
if ! [[ "$param1" =~ ^[0-9]+$ && "$param2" =~ ^[0-9]+$ ]]; then
  echo "Будь ласка, введіть два числових параметри."
  exit 1
fi

# Порівняння параметрів
if [ "$param1" -gt "$param2" ]; then
  echo "Перший параметр більше за другий."
  echo "Список псевдонімів вашої системи:"
  ./save_aliases.sh
  cat aliases.txt
  exit 1
else
  echo "Перший параметр не більше за другий."
  echo "Розмір файлу скрипта ($script_name):"
  stat --format="%s байт" "$0"
  exit 1
fi
